app/Soap/Fedex/OpenShipService/OpenShip_v13/ModifyOpenShipmentRequest_Reply.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v13="http://fedex.com/ws/openship/v13">
   <soapenv:Header/>
   <soapenv:Body>
      <v13:ModifyOpenShipmentRequest>
         <v13:WebAuthenticationDetail>
            <v13:ParentCredential>
               <v13:Key>RZEndj3VoTN7IZPr</v13:Key>
               <v13:Password>FyOhzHVSNhQOhGlOoT7R5DRAW</v13:Password>
            </v13:ParentCredential>
            <v13:UserCredential>
               <v13:Key>IwxibuPidazmPdWY</v13:Key>
               <v13:Password>lqPWoVeWGAFboqFOtiBU9qfCy</v13:Password>
            </v13:UserCredential>
         </v13:WebAuthenticationDetail>
         <v13:ClientDetail>
            <v13:AccountNumber>606503768</v13:AccountNumber>
            <v13:MeterNumber>100243452</v13:MeterNumber>
            <v13:Localization>
               <v13:LanguageCode>EN</v13:LanguageCode>
               <v13:LocaleCode>en</v13:LocaleCode>
            </v13:Localization>
         </v13:ClientDetail>
         <v13:TransactionDetail>
            <v13:CustomerTransactionId>ModifyOpenShipmentRequest_v6</v13:CustomerTransactionId>
            <v13:Localization>
               <v13:LanguageCode>EN</v13:LanguageCode>
               <v13:LocaleCode>en</v13:LocaleCode>
            </v13:Localization>
         </v13:TransactionDetail>
         <v13:Version>
            <v13:ServiceId>ship</v13:ServiceId>
            <v13:Major>13</v13:Major>
            <v13:Intermediate>0</v13:Intermediate>
            <v13:Minor>0</v13:Minor>
         </v13:Version>
         <v13:Index>SSS44</v13:Index>
         <v13:RequestedShipment>
            <v13:ShipTimestamp>2016-12-17T16:16:44-06:00</v13:ShipTimestamp>
            <v13:DropoffType>REGULAR_PICKUP</v13:DropoffType>
            <v13:ServiceType>INTERNATIONAL_PRIORITY</v13:ServiceType>
            <v13:PackagingType>YOUR_PACKAGING</v13:PackagingType>
            <v13:TotalWeight>
               <v13:Units>LB</v13:Units>
               <v13:Value>50.00</v13:Value>
            </v13:TotalWeight>
            <v13:PreferredCurrency>USD</v13:PreferredCurrency>
            <v13:Shipper>
               <v13:AccountNumber>606503768</v13:AccountNumber>
               <v13:Contact>
                  <v13:PersonName>SWAPNIL GHADAGE</v13:PersonName>
                  <v13:CompanyName>SYNTEL</v13:CompanyName>
                  <v13:PhoneNumber>9764859161</v13:PhoneNumber>
                  <v13:EMailAddress>SWAPNILSGHADAGE@SYNTEL.COM</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>DDD VVV 1</v13:StreetLines>
                  <v13:City>Memphis</v13:City>
                  <v13:StateOrProvinceCode>TN</v13:StateOrProvinceCode>
                  <v13:PostalCode>38118</v13:PostalCode>
                  <v13:CountryCode>US</v13:CountryCode>
               </v13:Address>
            </v13:Shipper>
            <v13:Recipient>
               <v13:AccountNumber>606503768</v13:AccountNumber>
               <v13:Contact>
                  <v13:PersonName>NILESH JARAD</v13:PersonName>
                  <v13:CompanyName>bYNTEL</v13:CompanyName>
                  <v13:PhoneNumber>9764859156</v13:PhoneNumber>
                  <v13:EMailAddress>NILESHJARAD@BYNTEL.COM</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>FFFF 444</v13:StreetLines>
                  <v13:City>ONTARIO</v13:City>
                  <v13:StateOrProvinceCode>ON</v13:StateOrProvinceCode>
                  <v13:PostalCode>M1M1M1</v13:PostalCode>
                  <v13:CountryCode>CA</v13:CountryCode>
               </v13:Address>
            </v13:Recipient>
            <v13:ShippingChargesPayment>
               <v13:PaymentType>SENDER</v13:PaymentType>
               <v13:Payor>
                  <v13:ResponsibleParty>
                     <v13:AccountNumber>606503768</v13:AccountNumber>
                     <v13:Contact>
                        <v13:PersonName>SWAPNIL GHADAGE</v13:PersonName>
                        <v13:CompanyName>SYNTEL</v13:CompanyName>
                        <v13:PhoneNumber>9764859161</v13:PhoneNumber>
                        <v13:EMailAddress>SWAPNILSGHADAGE@SYNTEL.COM</v13:EMailAddress>
                     </v13:Contact>
                     <v13:Address>
                        <v13:StreetLines>BARAMATI 1</v13:StreetLines>
                        <v13:City>Memphis</v13:City>
                        <v13:StateOrProvinceCode>TN</v13:StateOrProvinceCode>
                        <v13:PostalCode>38118</v13:PostalCode>
                        <v13:CountryCode>US</v13:CountryCode>
                     </v13:Address>
                  </v13:ResponsibleParty>
               </v13:Payor>
            </v13:ShippingChargesPayment>
            <v13:CustomsClearanceDetail>
               <v13:DutiesPayment>
                  <v13:PaymentType>SENDER</v13:PaymentType>
                  <v13:Payor>
                     <v13:ResponsibleParty>
                        <v13:AccountNumber>606503768</v13:AccountNumber>
                        <v13:Contact>
                           <v13:PersonName>SWAPNIL GHADAGE</v13:PersonName>
                           <v13:CompanyName>SYNTEL</v13:CompanyName>
                           <v13:PhoneNumber>9764859161</v13:PhoneNumber>
                           <v13:EMailAddress>SWAPNIL_GHADAGE@GMAIL.COM</v13:EMailAddress>
                        </v13:Contact>
                        <v13:Address>
                           <v13:StreetLines>BARAMATI</v13:StreetLines>
                           <v13:City>Memphis</v13:City>
                           <v13:StateOrProvinceCode>TN</v13:StateOrProvinceCode>
                           <v13:PostalCode>38118</v13:PostalCode>
                           <v13:CountryCode>US</v13:CountryCode>
                        </v13:Address>
                     </v13:ResponsibleParty>
                  </v13:Payor>
               </v13:DutiesPayment>
               <v13:DocumentContent>DOCUMENTS_ONLY</v13:DocumentContent>
               <v13:CustomsValue>
                  <v13:Currency>USD</v13:Currency>
                  <v13:Amount>2500.000000</v13:Amount>
               </v13:CustomsValue>
               <v13:CommercialInvoice>
                  <v13:TermsOfSale>DAP</v13:TermsOfSale>
               </v13:CommercialInvoice>
               <v13:Commodities>
                  <v13:NumberOfPieces>1</v13:NumberOfPieces>
                  <v13:Description>sdf</v13:Description>
                  <v13:CountryOfManufacture>US</v13:CountryOfManufacture>
                  <v13:Weight>
                     <v13:Units>LB</v13:Units>
                     <v13:Value>20.22</v13:Value>
                  </v13:Weight>
                  <v13:Quantity>1</v13:Quantity>
                  <v13:QuantityUnits>cm</v13:QuantityUnits>
                  <v13:UnitPrice>
                     <v13:Currency>USD</v13:Currency>
                     <v13:Amount>45</v13:Amount>
                  </v13:UnitPrice>
                  <v13:CustomsValue>
                     <v13:Currency>USD</v13:Currency>
                     <v13:Amount>2500.000000</v13:Amount>
                  </v13:CustomsValue>
               </v13:Commodities>
            </v13:CustomsClearanceDetail>
            <v13:LabelSpecification>
               <v13:Dispositions>
                  <v13:DispositionType>STORED</v13:DispositionType>
               </v13:Dispositions>
               <v13:LabelFormatType>COMMON2D</v13:LabelFormatType>
               <v13:ImageType>PNG</v13:ImageType>
               <v13:LabelStockType>PAPER_4X6</v13:LabelStockType>
               <v13:LabelPrintingOrientation>TOP_EDGE_OF_TEXT_FIRST</v13:LabelPrintingOrientation>
            </v13:LabelSpecification>
            <v13:RateRequestTypes>LIST</v13:RateRequestTypes>
            <v13:PackageCount>2</v13:PackageCount>
            <v13:RequestedPackageLineItems>
               <v13:SequenceNumber>1</v13:SequenceNumber>
               <v13:GroupNumber>1</v13:GroupNumber>
               <v13:GroupPackageCount>2</v13:GroupPackageCount>
               <v13:Weight>
                  <v13:Units>LB</v13:Units>
                  <v13:Value>50</v13:Value>
               </v13:Weight>
               <v13:Dimensions>
                  <v13:Length>11</v13:Length>
                  <v13:Width>20</v13:Width>
                  <v13:Height>11</v13:Height>
                  <v13:Units>IN</v13:Units>
               </v13:Dimensions>
               <v13:PhysicalPackaging>BAG</v13:PhysicalPackaging>
               <v13:ItemDescription>BAG</v13:ItemDescription>
               <v13:ContentRecords>
                  <v13:PartNumber>1</v13:PartNumber>
                  <v13:ItemNumber>1</v13:ItemNumber>
                  <v13:ReceivedQuantity>1</v13:ReceivedQuantity>
                  <v13:Description>bag</v13:Description>
               </v13:ContentRecords>
            </v13:RequestedPackageLineItems>
         </v13:RequestedShipment>
      </v13:ModifyOpenShipmentRequest>
   </soapenv:Body>
</soapenv:Envelope>

Out:

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <ModifyOpenShipmentReply xmlns="http://fedex.com/ws/openship/v13">
         <HighestSeverity>SUCCESS</HighestSeverity>
         <Notifications>
            <Severity>SUCCESS</Severity>
            <Source>ship</Source>
            <Code>0000</Code>
            <Message>Success</Message>
            <LocalizedMessage>Success</LocalizedMessage>
         </Notifications>
         <TransactionDetail>
            <CustomerTransactionId>ModifyOpenShipmentRequest_v6</CustomerTransactionId>
            <Localization>
               <LanguageCode>EN</LanguageCode>
               <LocaleCode>en</LocaleCode>
            </Localization>
         </TransactionDetail>
         <Version>
            <ServiceId>ship</ServiceId>
            <Major>13</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <JobId>361e2631b3142ds03115j201089</JobId>
         <AsynchronousProcessingResults>
            <Options>SYNCHRONOUSLY_PROCESSED</Options>
         </AsynchronousProcessingResults>
         <CompletedShipmentDetail>
            <UsDomestic>false</UsDomestic>
            <CarrierCode>FDXE</CarrierCode>
            <MasterTrackingId>
               <TrackingIdType>FEDEX</TrackingIdType>
               <FormId>0430</FormId>
               <TrackingNumber>794890385077</TrackingNumber>
            </MasterTrackingId>
            <CompletedPackageDetails>
               <SequenceNumber>1</SequenceNumber>
               <TrackingIds>
                  <TrackingIdType>FEDEX</TrackingIdType>
                  <FormId>0430</FormId>
                  <TrackingNumber>794890385077</TrackingNumber>
               </TrackingIds>
               <GroupNumber>0</GroupNumber>
            </CompletedPackageDetails>
            <CompletedPackageDetails>
               <SequenceNumber>2</SequenceNumber>
               <TrackingIds>
                  <TrackingIdType>FEDEX</TrackingIdType>
                  <FormId>0441</FormId>
                  <TrackingNumber>794890385033</TrackingNumber>
               </TrackingIds>
               <GroupNumber>0</GroupNumber>
            </CompletedPackageDetails>
         </CompletedShipmentDetail>
      </ModifyOpenShipmentReply>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>